{
  "head": {
    "title": "Yunzhe Li",
    "icon": "images/SJTU.png"
  },
  "header": {
    "index": true,
    "news": true,
    "research": true,
    "publication": true,
    "fun": false,
    "cv": true
  },
  "name_en": "Yunzhe Li",
  "name_zn": "李蕴哲",
  "name_tag": "M.S. Student",
  "tel": "+86 15553310916",
  "email": "liyzh28@sjtu.edu.cn",
  "website": "liyzh28@github.io",
  "github": "https://github.com/liyzh28",
  "scholar": "https://scholar.google.com/citations?user=QafNtQIAAAAJ",
  "city": "Shanghai, China",
  "avatar": "images/default.JPG",
  "introduction": "I am Yunzhe Li(Alex), a two-year academic master' student from <a href=\"https://english.seiee.sjtu.edu.cn\">SEIEE</a> of <a href=\"https://en.sjtu.edu.cn\">Shanghai Jiao Tong University (SJTU)</a>, supervised by Prof. <a href=\"https://scholar.google.com/citations?user=OBVW2YgAAAAJ&hl=zh-CN&oi=sra\">Dong Wang</a>.\n I received my B.S. degree from the <a herf=\"cse.sysu.edu.cn\"> SDCS </a> of <a href=\"http://www.sysu.edu.cn/en/index.htm\">Sun Yat-Sen University (SYSU)</a>. My reseach interest lies in data mining, especially for information retrival and recommendation algorithm. I focus on leveraging the social relation and temporal information to improve the performance of recommendation and clustering.",
  "education": [
    {
      "school": "Shanghai Jiao Tong University (SJTU), Shanghai, China",
      "major": "Master of Computer Science",
      "period": "Sept. 2019 - Till Now"
    },
    {
      "school": "Sun Yat-Sen University (SYSU), Guangzhou, China",
      "major": "Bachelor of Software Engineering",
      "period": "Sept. 2015 - Jun. 2019"
    }
  ],
  "publication": [
    {
      "title": "Extracting Attentive Social Temporal Excitation for Sequential Recommendation",
      "author": [
        "Yunzhe Li",
        "Yue Ding", 
        "Bo Chen", 
        "Xin Xin", 
        "Yule Wang", 
        "Yuxiang Shi", 
        "Ruiming Tang", 
        "Dong Wang"	
      ],
      "author_order": 1,
      "conf_or_jour": "ACM International Conference on Information and Knowledge Management (CIKM) 2021",
      "resource":{
      }
    },
    {
      "title": "CMT: Cluster-Wise Multi-Objective Training for Long-Tail Recommendation",
      "author": [
        "Yule Wang", 
        "Xin Xin", 
        "Yue Ding", 
        "Yunzhe Li",
        "Yuxiang Shi", 
        "Dong Wang"
      ],
      "author_order": 4,
      "conf_or_jour": "IEEE International Conference on Data Mining (ICDM) 2021, Under Review",
      "resource":{
      }
    },
    {
      "title": "AIRec: Attentive intersection model for tag-aware recommendation",
      "url": "https://www.sciencedirect.com/science/article/pii/S0925231220312789?via%3Dihub",
      "author": [
        "Bo Chen", 
        "Yue Ding", 
        "Xin Xin", "Yunzhe Li", "Yule Wang", "Dong Wang"
      ],
      "author_order": 4,
      "conf_or_jour": "Neurocomputing (NC), 2021, Pages 105-114",
      "resource": {
      }
    }
  ],
  "honor_award": [
    "2018 China National Scholarship.",
    "2016-2019 First-class Scholarship for Outstanding Students in SYSU.",
    "2018 The National College Student Programming Competition, Second Prize in Guangdong Province.",
    "2017 The National College Student Robot Contest, Third Prize in the South Race Area.",
    "2017 China National Encouragement Scholarship.",
    "2017 American Mathematical Contest In Modeling, Honorable Mention.",
    "2016 Sun Yat-Sen University ACM/ICPC Competition, Seconed Prize."
  ],
  "news": [
    {
      "date": "Aug. 2021",
      "content": "Our paper \"Extracting Attentive Social Temporal Excitation for Sequential Recommendation\" has been accepted by <span class=\"item-bold\">CIKM 2021</span>."
    },
    {
      "date": "Oct. 2020",
      "content": "Our paper \"AIRec: Attentive intersection model for tag-aware recommendation\" has been accepted by <span class=\"item-bold\"> Neurocomputing </span> after a cycle of revisions."
    },
    {
      "date": "Sept. 2019",
      "content": "Start to pursue for my Master degree in <span class=\"item-bold\">SJTU</span>"
    },
    {
      "date": "Jun. 2019",
      "content": "Graduate from <span class=\"item-bold\">SYSU</span>."
    },
    {
      "date": "Jan. 2019",
      "content": "Finished internship at JY Asset Management Ltd."
    }
  ],
  "research": [
    {
      "topic": "Attentive Social Temporal Excitation for Sequential Recommendation",
      "project": [
        {
          "fig": "images/sten.JPG",
          "intro": "In collaborative filtering, it is critical to make full use of social information to improve the recommendation quality, which has been proven to be effective because user behavior will be affected by her friends. We propose a novel sequential recommendation framework called Social Temporal Excitation Networks (STEN), which introduces temporal point processes to model the fine-grained impact of friends' behaviors on the user's dynamic interests in an event-level direct paradigm. "

        }
      ]
    },
    {
      "topic": "Cluster-Wise Multi-Objective Training for Long-Tail Recommendation",
      "project":[
        {
          "fig":"images/cmt.JPG",
          "intro": "The data used to train a recommender system (RS) usually suffers from severe popularity bias, i.e., the item frequency distribution is a highly skewed long-tail distribution. We find that the gradients coming from head items dominate the overall gradient update process, which further affects the optimization of tail items. Furthermore, we propose a general framework namely Cluster-Wise Multi-Objective Training (CMT) for long-tail recommendation, which is featured with popularity disentanglement, cluster-wise multi-objective optimization, and robust contractive regularization."
        }
      ]
    },
    {
      "topic": "Graph-Enhanced Repeat Aware Model for Session-Based Recommendation",
      "project": [    
        {
          "fig": "images/rpg.JPG",
          "intro": "Session-based recommendation aims to make recommendation through anonymous sessions. To solve the problem of repeat consumption, we propose GRASER, which utilizes graph neural networks (GNN) and an encoder-decoder structure to make recommendation. The session sequence is first converted to the session graph, then the encoder generates the session representation by two attention networks, and the decoder disintegrates it into three components, i.e., status, repeat and explore, to make recommendation under different circumstances and optimize repeat consumption."
        }
      ]
    },
    {
      "topic": "Attentive Intersection Model for Tag-Aware Recommendation",
      "project": [
        {
          "fig": "images/airec.JPG",
          "intro": "Existing tag-aware recommender methods construct user representations through either explicit tagging behaviors or implicit interacted items, which is inadequate to capture multi-aspect user preferences. We propose an attentive intersection model for TRS, to address the above issues. The intersection between user and item tags is exploited to enhance the learning of conjunct features. Finally, the user and item representations are concatenated and fed to factorization machines (FM) for score prediction."
        }
      ]
    }
  ],
  "language": [
    "Chinese",
    "English"
  ],
  "hobby": [
    "Travelling",
    "Badminton",
    "Jogging",
    "Board Game",
    "Cooking"
  ],
  "information": "Latest updated by August 2021",
  "message": ""
}